Revit 2024 API
RadialArray.Create Method
Overload List
Name | Description
Create(Document, View, ElementId, Int32, Line, Double, ArrayAnchorMember)
 Creates a new radial array element from a single element based on an input rotation axis.
Create(Document, View, ICollection<ElementId>, Int32, Line, Double, ArrayAnchorMember)
 Creates a new radial array element from a set of elements based on an input rotation axis.
See Also
RadialArray Class
RadialArray Members
Autodesk.Revit.DB Namespace